%{
将lcdata.xml文件删除或改名
将lcdata_utf8.xml改为lcdata.xml
然后将其修改，将
        <encoding name="GBK"/>
        <encoding name="GB2312">
            <encoding_alias name="EUC-CN"/>
        </encoding>
修改为：
        <encoding name="GBK"/>
        <encoding name="utf-8">
	        <encoding_alias name="utf8"/>
	        <encoding_alias name="GBK"/>
            <encoding_alias name="EUC-CN"/>
        </encoding>

%% 以上还需将Editor的字体修改为支持中文的字体，比如微软雅黑 or Monospaced  

%% 可用以下命令查看编码方式
%% slCharacterEncoding()
%% 更改编码方式
%% slCharacterEncoding('UTF-8')
%% feature('DefaultCharacterSet','UTF-8')
%}

%% 平面坐标四参数转换时的病态矩阵问题探讨
%% 本文件为原始数据（即对数据不做处理的计算）
clear

XY = [103,3927002.191,449256.848,327156.644,485664.463;
      100,3928471.180,451589.920,328638.283,487989.669;
      102,3928308.824,446388.500,328447.816,482788.977]

BL = [1, 0, 3927002.191, -449256.848, 327156.644;
      0, 1,  449256.848, 3927002.191, 485664.463;
      1, 0, 3928471.180, -451589.920, 328638.283;
      0, 1,  451589.920, 3928471.180, 487989.669;
      1, 0, 3928308.824, -446388.500, 328447.816;
      0, 1,  446388.500, 3928308.824, 482788.977];

B = BL(:, 1:4)
l = BL(:, 5)

N = B'*B
U = B'*l

C2 = cond(N)      %%2-范数，   此处运算值为 C2 = 4.96866666119918e+19 ， 非常大
C1 = cond(N, 1)   %%1-范数，   此处运算值为 C1 = 4.92806613586435e+19 ， 非常大
C8 = cond(N, Inf) %%Inf-范数， 此处运算值为 C8 = 4.92806613586435e+19 ， 非常大
 
X = N \ U %% 有矩阵病态问题存???

K=sqrt(X(3)*X(3) + X(4)*X(4))


%{
以下为计算结果，数据失真
N =
                         3                         0              11783782.195              -1347235.268
                         0                         3               1347235.268              11783782.195
              11783782.195               1347235.268          46890870101178.4     -1.34599395096302e-05
              -1347235.268              11783782.195     -1.34599395096302e-05          46890870101178.4
U =
                984242.743
               1456443.109
          4520106083691.81
          5278800533047.99
X =
         -3602385.71588925
          57613.4084366477
          1.00002870121994
      -0.00540327804367389
K =
          1.00004329840125
%}
